Documents/АктСверкиВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>АктСверкиВзаиморасчетов</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СверкаСогласована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокНаНачало</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расхождение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставительОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставительКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоДаннымОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВозвратПродукции</v8:Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТовараПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ОплатаБанковскойКартой</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТовараОтПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дебет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кредит</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоДаннымКонтрагента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВозвратПродукции</v8:Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТовараПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ОплатаБанковскойКартой</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТовараОтПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дебет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кредит</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/АктСверкиВзаиморасчетов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПредставительОрганизации(Организация) Экспорт
	
	ПредставительОрганизации = Справочники.Сотрудники.ПустаяСсылка();	
	Если ЗначениеЗаполнено(Организация) Тогда
		ПредставительОрганизации = Организация.Руководитель;
		Если НЕ ЗначениеЗаполнено(ПредставительОрганизации) Тогда
			ПредставительОрганизации = Организация.ГлавныйБухгалтер;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ПредставительОрганизации) Тогда
			ПредставительОрганизации = ОбщийМодульСервер.НастройкаПользователя("Сотрудник");
		КонецЕсли;
	Иначе
		ПредставительОрганизации = ОбщийМодульСервер.НастройкаПользователя("Сотрудник");
	КонецЕсли;
	
	Возврат ПредставительОрганизации;
	
КонецФункции

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.АктСверкиВзаиморасчетов";
    КомандаПечати.Идентификатор = "АктСверки";
    КомандаПечати.Представление = НСтр("ru = 'Акт сверки'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	КомандаПечати.Порядок = 1;	

	КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.АктСверкиВзаиморасчетов";
    КомандаПечати.Идентификатор = "АктСверкиСПечатьюИПодписью";
    КомандаПечати.Представление = НСтр("ru = 'Акт сверки (с печатью и подписью)'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	КомандаПечати.Порядок = 2;
	
	//nva+++
	КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.АктСверкиВзаиморасчетов";
    КомандаПечати.Идентификатор = "АктСверкиСАдресами";
    КомандаПечати.Представление = НСтр("ru = 'Акт сверки с адресами'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	КомандаПечати.Порядок = 3;
	//nva---
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
// МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
// ПараметрыПечати – Структура – дополнительные настройки печати;
// КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
// ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
// представление – имя области, в которой был выведен объект (выходной параметр);
// ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСверки") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
        	"АктСверки",
        	НСтр("ru = 'Акт сверки'"),
        	СформироватьПечатнуюФормуАктаСверки(МассивОбъектов, ОбъектыПечати),
        	,
        	"Документ.АктСверкиВзаиморасчетов.ПФ_MXL_АктСверки");
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСверкиСПечатьюИПодписью") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
        	"АктСверкиСПечатьюИПодписью",
        	НСтр("ru = 'Акт сверки (с печатью и подписью)'"),
        	СформироватьПечатнуюФормуАктаСверки(МассивОбъектов, ОбъектыПечати, Истина),
        	,
        	"Документ.АктСверкиВзаиморасчетов.ПФ_MXL_АктСверки"); 
	//nva+++		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСверкиСАдресами") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
        	"АктСверкиСАдресами",
        	НСтр("ru = 'Акт сверки с адресами'"),
        	СформироватьПечатнуюФормуАктаСверкиСАдресами(МассивОбъектов, ОбъектыПечати),
        	,
        	"Документ.АктСверкиВзаиморасчетов.ПФ_MXL_АктСверки");
	//nva---		
    КонецЕсли;	
КонецПроцедуры

// Формирует и возвращает текст запроса для выборки данных,
//// необходимых для формирования печатной формы.
////
Функция ПолучитьДанныеДляПечатныхФорм(МассивОбъектов) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧПоДаннымОрганизации.Ссылка КАК АктСверки,
	|	0 КАК НомерТабЧасти,
	|	ТЧПоДаннымОрганизации.НомерСтроки КАК НомерСтроки,
	|	ТЧПоДаннымОрганизации.Дата КАК Дата,
	|	ТЧПоДаннымОрганизации.Документ КАК Документ,
	|	ТЧПоДаннымОрганизации.Представление КАК Представление,
	|	ТЧПоДаннымОрганизации.Дебет КАК Дебет,
	|	ТЧПоДаннымОрганизации.Кредит КАК Кредит,
	|	NULL КАК ПредставлениеКонтр,
	|	NULL КАК ДатаКонтр,
	|	0 КАК ДебетКонтр,
	|	0 КАК КредитКонтр,
	|	ТЧПоДаннымОрганизации.Документ.Основание.АдресМонтажа КАК АдресМонтажа,
	|	ТЧПоДаннымОрганизации.Документ.Основание.АдресДоставки КАК АдресДоставки
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК ТЧПоДаннымОрганизации
	|ГДЕ
	|	ТЧПоДаннымОрганизации.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧПоДаннымКонтрагента.Ссылка,
	|	1,
	|	ТЧПоДаннымКонтрагента.НомерСтроки,
	|	NULL,
	|	NULL,
	|	NULL,
	|	0,
	|	0,
	|	ТЧПоДаннымКонтрагента.Представление,
	|	ТЧПоДаннымКонтрагента.Дата,
	|	ТЧПоДаннымКонтрагента.Дебет,
	|	ТЧПоДаннымКонтрагента.Кредит,
	|	"""",
	|	""""
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов.ПоДаннымКонтрагента КАК ТЧПоДаннымКонтрагента
	|ГДЕ
	|	ТЧПоДаннымКонтрагента.Ссылка В(&МассивОбъектов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АктСверки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктСверкиВзаиморасчетов.Ссылка КАК АктСверки,
	|	АктСверкиВзаиморасчетов.ДоговорКонтрагента КАК Договор,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Дата КАК МинДата,
	|	ДанныеДокумента.Документ КАК Регистратор,
	|	ДанныеДокумента.Представление КАК Представление,
	|	ДанныеДокумента.ДатаКонтр КАК ДатаКонтр,
	|	ДанныеДокумента.ПредставлениеКонтр КАК ПредставлениеКонтр,
	|	ЕСТЬNULL(ДанныеДокумента.Дебет, 0) КАК СуммаОборотДт,
	|	ЕСТЬNULL(ДанныеДокумента.Кредит, 0) КАК СуммаОборотКт,
	|	ЕСТЬNULL(ДанныеДокумента.ДебетКонтр, 0) КАК СуммаОборотДтКонтр,
	|	ЕСТЬNULL(ДанныеДокумента.КредитКонтр, 0) КАК СуммаОборотКтКонтр,
	|	АктСверкиВзаиморасчетов.Организация КАК Организация,
	|	АктСверкиВзаиморасчетов.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА НЕ АктСверкиВзаиморасчетов.Контрагент.НаименованиеПолное = """"
	|			ТОГДА АктСверкиВзаиморасчетов.Контрагент.НаименованиеПолное
	|		ИНАЧЕ АктСверкиВзаиморасчетов.Контрагент.Наименование
	|	КОНЕЦ КАК ПредставлениеКонтрагента,
	|	АктСверкиВзаиморасчетов.Дата КАК ДатаАктаСверки,
	|	АктСверкиВзаиморасчетов.ПредставительОрганизации КАК ПредставительОрганизации,
	|	АктСверкиВзаиморасчетов.ПредставительКонтрагента КАК ПредставительКонтрагента,
	|	АктСверкиВзаиморасчетов.ДатаНачала КАК ДатаНачала,
	|	АктСверкиВзаиморасчетов.ДатаОкончания КАК ДатаОкончания,
	|	АктСверкиВзаиморасчетов.ОстатокНаНачало КАК ОстатокНаНачало,
	|	АктСверкиВзаиморасчетов.Расхождение КАК Расхождение,
	|	АктСверкиВзаиморасчетов.ДоговорКонтрагента КАК ДоговорКонтрагентаВШапке,
	|	АктСверкиВзаиморасчетов.ВалютаДокумента КАК ВалютаДокумента,
	|	АктСверкиВзаиморасчетов.СверкаСогласована КАК СверкаСогласована,
	|	ДанныеДокумента.НомерТабЧасти КАК НомерТабЧасти,
	|	ДанныеДокумента.АдресМонтажа КАК АдресМонтажа,
	|	ДанныеДокумента.АдресДоставки КАК АдресДоставки
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов КАК АктСверкиВзаиморасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокумента КАК ДанныеДокумента
	|		ПО (ДанныеДокумента.АктСверки = АктСверкиВзаиморасчетов.Ссылка)
	|ГДЕ
	|	АктСверкиВзаиморасчетов.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТабЧасти,
	|	ДанныеДокумента.НомерСтроки
	|ИТОГИ
	|	МИНИМУМ(МинДата),
	|	СУММА(СуммаОборотДт),
	|	СУММА(СуммаОборотКт),
	|	СУММА(СуммаОборотДтКонтр),
	|	СУММА(СуммаОборотКтКонтр),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Контрагент),
	|	МАКСИМУМ(ДатаАктаСверки),
	|	МАКСИМУМ(ПредставительОрганизации),
	|	МАКСИМУМ(ПредставительКонтрагента),
	|	МАКСИМУМ(ДатаНачала),
	|	МАКСИМУМ(ДатаОкончания),
	|	МАКСИМУМ(ОстатокНаНачало),
	|	МАКСИМУМ(Расхождение),
	|	МАКСИМУМ(ДоговорКонтрагентаВШапке),
	|	МАКСИМУМ(ВалютаДокумента),
	|	МАКСИМУМ(СверкаСогласована)
	|ПО
	|	АктСверки,
	|	Договор";
	
	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[1];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке",
	                                               РезультатПоШапке);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

// Функция формирует табличный документ с печатной формой 
////
//// Возвращаемое значение:
////  Табличный документ - печатная форма.
////
Функция СформироватьПечатнуюФормуАктаСверки(МассивОбъектов, ОбъектыПечати, СПечатью = Ложь)

//	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АктСверкиВзаиморасчетов";
	
	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	//ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();
	//ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.АктСверкиВзаиморасчетов.ПФ_MXL_АктСверки");
	
	// Проверим есть ли нужная область макета. Если область не найдена, то используем старый макет.
	Если СПечатью И НЕ ЗначениеЗаполнено(Макет.Области.Найти("ПодвалСПечатьюИПодписью")) Тогда
		СПечатью = Ложь;
	КонецЕсли;
		
	ДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "АктСверки");
	
	ПервыйДокумент = Истина;	
	Пока ДанныеПечати.Следующий() Цикл
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		ПервыйДокумент = Ложь;		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Получаем области
		ОбластьЗаголовок    = Макет.ПолучитьОбласть("Заголовок");
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьНачОстатки   = Макет.ПолучитьОбласть("НачОстатки");
		ОбластьДоговор      = Макет.ПолучитьОбласть("Договор");
		ОбластьДоговорИтоги = Макет.ПолучитьОбласть("ДоговорИтоги");
		ОбластьОбороты      = Макет.ПолучитьОбласть("Обороты");
		ОбластьОборотыИтог  = Макет.ПолучитьОбласть("ОборотыИтог");
		ОбластьКонОстатки   = Макет.ПолучитьОбласть("КонОстатки");
		Если СПечатью Тогда
			ОбластьПодвал   = Макет.ПолучитьОбласть("ПодвалСПечатьюИПодписью");
		Иначе
			ОбластьПодвал   = Макет.ПолучитьОбласть("Подвал");
		КонецЕсли;
		
		// Заполняем шапку
		ОбластьЗаголовок.Параметры.Заполнить(ДанныеПечати);
		Попытка		
			// За период
			ДатаНачалаОтчета = ?(ЗначениеЗаполнено(ДанныеПечати.ДатаНачала), ДанныеПечати.ДатаНачала, ДанныеПечати.МинДата);
			Если ЗначениеЗаполнено(ДатаНачалаОтчета) Тогда
				ЗаПериод = ПредставлениеПериода(НачалоДня(ДатаНачалаОтчета), КонецДня(ДанныеПечати.ДатаОкончания), "ФП = Истина");
				ОбластьЗаголовок.Параметры.ЗаПериод = СтрШаблон(НСтр("ru='за период: %1'"), ЗаПериод);
			КонецЕсли;			
		Исключение			
		КонецПопытки;

		Попытка		
			// По договору
			Если ЗначениеЗаполнено(ДанныеПечати.ДоговорКонтрагентаВШапке) Тогда
				ОбластьЗаголовок.Параметры.ПоДоговору = Символы.ПС + СтрШаблон(НСтр("ru='по договору %1'"), ДанныеПечати.ДоговорКонтрагентаВШапке);
			КонецЕсли;
		Исключение			
		КонецПопытки;
		
		Попытка
			// Валюта документа
			ОбластьЗаголовок.Параметры.ВалютаДокумента = ДанныеПечати.ВалютаДокумента;
		Исключение			
		КонецПопытки;
		
		// Выводим шапку
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		
		// Строки таблицы
		ПараметрыНачальныеОстатки = Новый Структура;
		ПараметрыНачальныеОстатки.Вставить("СуммаНачальныйОстатокДт", ?(ДанныеПечати.ОстатокНаНачало > 0, ДанныеПечати.ОстатокНаНачало, 0));
		ПараметрыНачальныеОстатки.Вставить("СуммаНачальныйОстатокКт", ?(ДанныеПечати.ОстатокНаНачало < 0, -ДанныеПечати.ОстатокНаНачало, 0));
		ОбластьНачОстатки.Параметры.Заполнить(ПараметрыНачальныеОстатки);
		ТабличныйДокумент.Вывести(ОбластьНачОстатки);
		
		
		ОбходПоДоговорам = ДанныеПечати.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Договор");
		Пока ОбходПоДоговорам.Следующий() Цикл			
			// Собираем данные
			ОбходПоДокументам = ОбходПоДоговорам.Выбрать();
			
			// Создадим список документов по организации и контрагенту.
			СписокДокументов  = Новый Массив;
			СписокДокументовК = Новый Массив;
			
			Пока ОбходПоДокументам.Следующий() Цикл
				Если ОбходПоДокументам.Дата <> NULL Тогда
					СтруктураДокумента = НовыйСтруктураДокумента();
					ЗаполнитьЗначенияСвойств(СтруктураДокумента, ОбходПоДокументам);
					СписокДокументов.Добавить(СтруктураДокумента);
				КонецЕсли;
				Если ОбходПоДокументам.ДатаКонтр <> NULL Тогда
					СтруктураДокумента = НовыйСтруктураДокумента(Истина);
					ЗаполнитьЗначенияСвойств(СтруктураДокумента, ОбходПоДокументам);
					СписокДокументовК.Добавить(СтруктураДокумента);
				КонецЕсли;
			КонецЦикла;
			
			// Не отображаем информацию по контрагенту, если не введены документы и сверка не согласована.
			// В этом случае будут пустые строки и итоги со стороны контрагента.
			ЗаполнятьДанныеКонтрагента = (ДанныеПечати.СверкаСогласована ИЛИ (СписокДокументовК.Количество() <> 0));
			
			// Выравняем таблицы по количеству строк
			РазницаСтрок = СписокДокументов.Количество() - СписокДокументовК.Количество();
			Если РазницаСтрок > 0 Тогда
				ДополняемаяТаблица = СписокДокументовК;
				НоваяСтрока = НовыйСтруктураДокумента(Истина);
			ИначеЕсли РазницаСтрок < 0 Тогда
				РазницаСтрок = -РазницаСтрок;
				ДополняемаяТаблица = СписокДокументов;
				НоваяСтрока = НовыйСтруктураДокумента();
			КонецЕсли;
			Для Счетчик = 1 По РазницаСтрок Цикл
				ДополняемаяТаблица.Добавить(НоваяСтрока);
			КонецЦикла;
			
			ЕстьСтрокиДокументов = (СписокДокументов.Количество() <> 0);
						
			Для Счетчик = 0 По СписокДокументов.Количество() - 1 Цикл
				// Выводим обороты
				ОбластьОбороты.Параметры.Заполнить(СписокДокументов[Счетчик]);
				ОбластьОбороты.Параметры.Заполнить(СписокДокументовК[Счетчик]);
				ТабличныйДокумент.Вывести(ОбластьОбороты);
			КонецЦикла;
			
		КонецЦикла;
		
		// Итоги по документам
		ОбластьОборотыИтог.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьОборотыИтог);
		
		// Итоги по контрагенту
		ОстатокНаКонец = ДанныеПечати.ОстатокНаНачало + ДанныеПечати.СуммаОборотДт - ДанныеПечати.СуммаОборотКт;
		Если ЗаполнятьДанныеКонтрагента Тогда
			ОстатокНаКонецКонтр = ДанныеПечати.ОстатокНаНачало - ДанныеПечати.СуммаОборотДтКонтр + ДанныеПечати.СуммаОборотКтКонтр;
		Иначе
			ОстатокНаКонецКонтр = 0;
		КонецЕсли;
		ПараметрыИтогиПоКонтрагенту = Новый Структура;
		ПараметрыИтогиПоКонтрагенту.Вставить("СуммаКонечныйОстатокДт",      ?(ОстатокНаКонец > 0, ОстатокНаКонец, 0));
		ПараметрыИтогиПоКонтрагенту.Вставить("СуммаКонечныйОстатокКт",      ?(ОстатокНаКонец < 0, -ОстатокНаКонец, 0));
		ПараметрыИтогиПоКонтрагенту.Вставить("СуммаКонечныйОстатокКтКонтр", ?(ОстатокНаКонецКонтр > 0, ОстатокНаКонецКонтр, 0));
		ПараметрыИтогиПоКонтрагенту.Вставить("СуммаКонечныйОстатокДтКонтр", ?(ОстатокНаКонецКонтр < 0, -ОстатокНаКонецКонтр, 0));
		ОбластьКонОстатки.Параметры.Заполнить(ПараметрыИтогиПоКонтрагенту);
		ТабличныйДокумент.Вывести(ОбластьКонОстатки);
		
		// Результаты сверки
		ПараметрыПодвала = Новый Структура;
		ПараметрыПодвала.Вставить("НаименованиеКонтрагента", ДанныеПечати.ПредставлениеКонтрагента);
		ПараметрыПодвала.Вставить("НазваниеОрганизации",     ДанныеПечати.Организация);
		ПараметрыПодвала.Вставить("Должность",               ДанныеПечати.ПредставительОрганизации.Должность);
		ПараметрыПодвала.Вставить("ДолжностьК",              ДанныеПечати.ПредставительКонтрагента.Должность);
		ПараметрыПодвала.Вставить("ФИОПредставителя",        СтрШаблон("(%1)", ДанныеПечати.ПредставительОрганизации));
		ПараметрыПодвала.Вставить("ФИОПредставителяК",       СтрШаблон("(%1)", ДанныеПечати.ПредставительКонтрагента));
		ПараметрыПодвала.Вставить("РезультатыСверки",
			РезультатСверки(ДанныеПечати, ОстатокНаКонец, ДанныеПечати.Организация, ДанныеПечати.Контрагент));
		Если ЗаполнятьДанныеКонтрагента Тогда
			ПараметрыПодвала.Вставить("РезультатыСверкиК",
				РезультатСверки(ДанныеПечати, ОстатокНаКонецКонтр, ДанныеПечати.Организация, ДанныеПечати.Контрагент));
		КонецЕсли;
		
		// Итог сверки выводим если нашли расхождение и сверка согласована.
		Если ДанныеПечати.Расхождение <> 0 И ДанныеПечати.СверкаСогласована Тогда
			СуммаРасхождение = ?(ДанныеПечати.Расхождение > 0, ДанныеПечати.Расхождение, -ДанныеПечати.Расхождение);
			ИтогСверки = СтрШаблон(НСтр("ru='В результате сверки выявлено расхождение информации о состоянии расчетов в размере %1 %2 %3'"),
				Формат(СуммаРасхождение, "ЧЦ=21; ЧДЦ=2"),
				Строка(ДанныеПечати.ВалютаДокумента),
				РаботаСВалютой.СформироватьЧислоПрописью(СуммаРасхождение, ДанныеПечати.ВалютаДокумента));
			ПараметрыПодвала.Вставить("ИтогСверки", Символы.ПС + ИтогСверки + Символы.ПС + " ");
		КонецЕсли;
//		
		Если СПечатью Тогда
			
//			ОтветственныеЛицаОрганизации = ОтветственныеЛицаБППовтИсп.ОтветственныеЛица(Шапка.Организация, Шапка.ДатаАктаСверки);

			ДвоичныеДанныеПечать = ДанныеПечати.Организация.ФайлПечать.Файл.Получить();
			Если ЗначениеЗаполнено(ДвоичныеДанныеПечать) Тогда
				ОбластьПодвал.Рисунки.Печать.Картинка = Новый Картинка(ДвоичныеДанныеПечать);
			КонецЕсли;
			Если ЗначениеЗаполнено(ДанныеПечати.ПредставительОрганизации) Тогда
				// Определим чью подпись необходимо подставить в документ. 
				// Определяем по ответственным лицам и представителю организации.
				Если ДанныеПечати.Организация.Руководитель = ДанныеПечати.ПредставительОрганизации Тогда
					ДвоичныеДанныеПодписьРуководителя = ДанныеПечати.Организация.ФайлПодписьРуководителя.Файл.Получить();
					Если ЗначениеЗаполнено(ДвоичныеДанныеПодписьРуководителя) Тогда 
						ОбластьПодвал.Рисунки.Подпись.Картинка = Новый Картинка(ДвоичныеДанныеПодписьРуководителя);
					КонецЕсли;
				ИначеЕсли ДанныеПечати.Организация.ГлавныйБухгалтер = ДанныеПечати.ПредставительОрганизации Тогда
					ДвоичныеДанныеПодписьГлавногоБухгалтера = ДанныеПечати.Организация.ФайлПодписьГлавногоБухгалтера.Файл.Получить();
					Если ЗначениеЗаполнено(ДвоичныеДанныеПодписьГлавногоБухгалтера) Тогда 
						ОбластьПодвал.Рисунки.Подпись.Картинка = Новый Картинка(ДвоичныеДанныеПодписьГлавногоБухгалтера);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ОбластьПодвал.Параметры.Заполнить(ПараметрыПодвала);
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		ТабличныйДокумент.ТолькоПросмотр = Истина;
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.АктСверки);
	
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции

//nva+++  

// Формирует и возвращает текст запроса для выборки данных,
//// необходимых для формирования печатной формы.
////
Функция ПолучитьДанныеДляПечатныхФормДопСвойства(МассивОбъектов) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧПоДаннымОрганизации.Ссылка КАК АктСверки,
	|	0 КАК НомерТабЧасти,
	|	ТЧПоДаннымОрганизации.НомерСтроки КАК НомерСтроки,
	|	ТЧПоДаннымОрганизации.Дата КАК Дата,
	|	ТЧПоДаннымОрганизации.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА ТЧПоДаннымОрганизации.Документ.Касса.Наименование ЕСТЬ NULL
	|			ТОГДА ТЧПоДаннымОрганизации.Представление
	|		ИНАЧЕ ТЧПоДаннымОрганизации.Представление + "", "" + (ВЫРАЗИТЬ(ТЧПоДаннымОрганизации.Документ.Касса.Наименование КАК СТРОКА(25)))
	|	КОНЕЦ КАК Представление,
	|	ТЧПоДаннымОрганизации.Дебет КАК Дебет,
	|	ТЧПоДаннымОрганизации.Кредит КАК Кредит,
	|	NULL КАК ПредставлениеКонтр,
	|	NULL КАК ДатаКонтр,
	|	0 КАК ДебетКонтр,
	|	0 КАК КредитКонтр,
	|	ТЧПоДаннымОрганизации.Документ.Основание.АдресМонтажа КАК АдресМонтажа,
	|	ТЧПоДаннымОрганизации.Документ.Основание.АдресДоставки КАК АдресДоставки
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК ТЧПоДаннымОрганизации
	|ГДЕ
	|	ТЧПоДаннымОрганизации.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧПоДаннымКонтрагента.Ссылка,
	|	1,
	|	ТЧПоДаннымКонтрагента.НомерСтроки,
	|	NULL,
	|	NULL,
	|	NULL,
	|	0,
	|	0,
	|	ТЧПоДаннымКонтрагента.Представление,
	|	ТЧПоДаннымКонтрагента.Дата,
	|	ТЧПоДаннымКонтрагента.Дебет,
	|	ТЧПоДаннымКонтрагента.Кредит,
	|	"""",
	|	""""
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов.ПоДаннымКонтрагента КАК ТЧПоДаннымКонтрагента
	|ГДЕ
	|	ТЧПоДаннымКонтрагента.Ссылка В(&МассивОбъектов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АктСверки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктСверкиВзаиморасчетов.Ссылка КАК АктСверки,
	|	АктСверкиВзаиморасчетов.ДоговорКонтрагента КАК Договор,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Дата КАК МинДата,
	|	ДанныеДокумента.Документ КАК Регистратор,
	|	ДанныеДокумента.Представление КАК Представление,
	|	ДанныеДокумента.ДатаКонтр КАК ДатаКонтр,
	|	ДанныеДокумента.ПредставлениеКонтр КАК ПредставлениеКонтр,
	|	ЕСТЬNULL(ДанныеДокумента.Дебет, 0) КАК СуммаОборотДт,
	|	ЕСТЬNULL(ДанныеДокумента.Кредит, 0) КАК СуммаОборотКт,
	|	ЕСТЬNULL(ДанныеДокумента.ДебетКонтр, 0) КАК СуммаОборотДтКонтр,
	|	ЕСТЬNULL(ДанныеДокумента.КредитКонтр, 0) КАК СуммаОборотКтКонтр,
	|	АктСверкиВзаиморасчетов.Организация КАК Организация,
	|	АктСверкиВзаиморасчетов.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА НЕ АктСверкиВзаиморасчетов.Контрагент.НаименованиеПолное = """"
	|			ТОГДА АктСверкиВзаиморасчетов.Контрагент.НаименованиеПолное
	|		ИНАЧЕ АктСверкиВзаиморасчетов.Контрагент.Наименование
	|	КОНЕЦ КАК ПредставлениеКонтрагента,
	|	АктСверкиВзаиморасчетов.Дата КАК ДатаАктаСверки,
	|	АктСверкиВзаиморасчетов.ПредставительОрганизации КАК ПредставительОрганизации,
	|	АктСверкиВзаиморасчетов.ПредставительКонтрагента КАК ПредставительКонтрагента,
	|	АктСверкиВзаиморасчетов.ДатаНачала КАК ДатаНачала,
	|	АктСверкиВзаиморасчетов.ДатаОкончания КАК ДатаОкончания,
	|	АктСверкиВзаиморасчетов.ОстатокНаНачало КАК ОстатокНаНачало,
	|	АктСверкиВзаиморасчетов.Расхождение КАК Расхождение,
	|	АктСверкиВзаиморасчетов.ДоговорКонтрагента КАК ДоговорКонтрагентаВШапке,
	|	АктСверкиВзаиморасчетов.ВалютаДокумента КАК ВалютаДокумента,
	|	АктСверкиВзаиморасчетов.СверкаСогласована КАК СверкаСогласована,
	|	ДанныеДокумента.НомерТабЧасти КАК НомерТабЧасти,
	|	ДанныеДокумента.АдресМонтажа КАК АдресМонтажа,
	|	ДанныеДокумента.АдресДоставки КАК АдресДоставки
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов КАК АктСверкиВзаиморасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокумента КАК ДанныеДокумента
	|		ПО (ДанныеДокумента.АктСверки = АктСверкиВзаиморасчетов.Ссылка)
	|ГДЕ
	|	АктСверкиВзаиморасчетов.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТабЧасти,
	|	ДанныеДокумента.НомерСтроки
	|ИТОГИ
	|	МИНИМУМ(МинДата),
	|	СУММА(СуммаОборотДт),
	|	СУММА(СуммаОборотКт),
	|	СУММА(СуммаОборотДтКонтр),
	|	СУММА(СуммаОборотКтКонтр),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Контрагент),
	|	МАКСИМУМ(ДатаАктаСверки),
	|	МАКСИМУМ(ПредставительОрганизации),
	|	МАКСИМУМ(ПредставительКонтрагента),
	|	МАКСИМУМ(ДатаНачала),
	|	МАКСИМУМ(ДатаОкончания),
	|	МАКСИМУМ(ОстатокНаНачало),
	|	МАКСИМУМ(Расхождение),
	|	МАКСИМУМ(ДоговорКонтрагентаВШапке),
	|	МАКСИМУМ(ВалютаДокумента),
	|	МАКСИМУМ(СверкаСогласована)
	|ПО
	|	АктСверки,
	|	Договор";
	
	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[1];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке",
	                                               РезультатПоШапке);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

Функция СформироватьПечатнуюФормуАктаСверкиСАдресами(МассивОбъектов, ОбъектыПечати, СПечатью = Ложь)

//	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АктСверкиВзаиморасчетовСАдресами";
	
	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФормДопСвойства(МассивОбъектов);
	//ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();
	//ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.АктСверкиВзаиморасчетов.ПФ_MXL_АктСверки");
	
	// Проверим есть ли нужная область макета. Если область не найдена, то используем старый макет.
	Если СПечатью И НЕ ЗначениеЗаполнено(Макет.Области.Найти("ПодвалСПечатьюИПодписью")) Тогда
		СПечатью = Ложь;
	КонецЕсли;
		
	ДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "АктСверки");
	
	ПервыйДокумент = Истина;	
	Пока ДанныеПечати.Следующий() Цикл
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		ПервыйДокумент = Ложь;		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Получаем области
		ОбластьЗаголовок    = Макет.ПолучитьОбласть("Заголовок");
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьНачОстатки   = Макет.ПолучитьОбласть("НачОстатки");
		ОбластьДоговор      = Макет.ПолучитьОбласть("Договор");
		ОбластьДоговорИтоги = Макет.ПолучитьОбласть("ДоговорИтоги");
		ОбластьОбороты      = Макет.ПолучитьОбласть("Обороты");
		ОбластьОборотыИтог  = Макет.ПолучитьОбласть("ОборотыИтог");
		ОбластьКонОстатки   = Макет.ПолучитьОбласть("КонОстатки");
		Если СПечатью Тогда
			ОбластьПодвал   = Макет.ПолучитьОбласть("ПодвалСПечатьюИПодписью");
		Иначе
			ОбластьПодвал   = Макет.ПолучитьОбласть("Подвал");
		КонецЕсли;
		
		// Заполняем шапку
		ОбластьЗаголовок.Параметры.Заполнить(ДанныеПечати);
		Попытка		
			// За период
			ДатаНачалаОтчета = ?(ЗначениеЗаполнено(ДанныеПечати.ДатаНачала), ДанныеПечати.ДатаНачала, ДанныеПечати.МинДата);
			Если ЗначениеЗаполнено(ДатаНачалаОтчета) Тогда
				ЗаПериод = ПредставлениеПериода(НачалоДня(ДатаНачалаОтчета), КонецДня(ДанныеПечати.ДатаОкончания), "ФП = Истина");
				ОбластьЗаголовок.Параметры.ЗаПериод = СтрШаблон(НСтр("ru='за период: %1'"), ЗаПериод);
			КонецЕсли;			
		Исключение			
		КонецПопытки;

		Попытка		
			// По договору
			Если ЗначениеЗаполнено(ДанныеПечати.ДоговорКонтрагентаВШапке) Тогда
				ОбластьЗаголовок.Параметры.ПоДоговору = Символы.ПС + СтрШаблон(НСтр("ru='по договору %1'"), ДанныеПечати.ДоговорКонтрагентаВШапке);
			КонецЕсли;
		Исключение			
		КонецПопытки;
		
		Попытка
			// Валюта документа
			ОбластьЗаголовок.Параметры.ВалютаДокумента = ДанныеПечати.ВалютаДокумента;
		Исключение			
		КонецПопытки;
		
		// Выводим шапку
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		
		// Строки таблицы
		ПараметрыНачальныеОстатки = Новый Структура;
		ПараметрыНачальныеОстатки.Вставить("СуммаНачальныйОстатокДт", ?(ДанныеПечати.ОстатокНаНачало > 0, ДанныеПечати.ОстатокНаНачало, 0));
		ПараметрыНачальныеОстатки.Вставить("СуммаНачальныйОстатокКт", ?(ДанныеПечати.ОстатокНаНачало < 0, -ДанныеПечати.ОстатокНаНачало, 0));
		ОбластьНачОстатки.Параметры.Заполнить(ПараметрыНачальныеОстатки);
		ТабличныйДокумент.Вывести(ОбластьНачОстатки);
		
		
		ОбходПоДоговорам = ДанныеПечати.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Договор");
		Пока ОбходПоДоговорам.Следующий() Цикл			
			// Собираем данные
			ОбходПоДокументам = ОбходПоДоговорам.Выбрать();
			
			// Создадим список документов по организации и контрагенту.
			СписокДокументов  = Новый Массив;
			СписокДокументовК = Новый Массив;
			МассивАдресов = Новый Массив;  //СтруктураДокумента.Представление + Символы.ВК + 
			
			Пока ОбходПоДокументам.Следующий() Цикл
				Если ОбходПоДокументам.Дата <> NULL Тогда
					СтруктураДокумента = НовыйСтруктураДокумента();
					ЗаполнитьЗначенияСвойств(СтруктураДокумента, ОбходПоДокументам);
					АдресК = "";
					Если ЗначениеЗаполнено(ОбходПоДокументам.АдресДоставки) Тогда
						АдресК = ОбходПоДокументам.АдресДоставки;
					КонецЕсли;
					Если ЗначениеЗаполнено(ОбходПоДокументам.АдресМонтажа) Тогда
						АдресК = ОбходПоДокументам.АдресМонтажа;
					КонецЕсли;
					Если НЕ ЗначениеЗаполнено(ОбходПоДокументам.АдресДоставки) И 
						НЕ ЗначениеЗаполнено(ОбходПоДокументам.АдресМонтажа) И 
						ТипЗнч(СтруктураДокумента.Регистратор) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
											
						Если ТипЗнч(СтруктураДокумента.Регистратор.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
							АдресДоставкиИзЗаявки = ПолучитьАдресИзЗаявкиНаДоставку(СтруктураДокумента.Регистратор.Основание);
							Если ЗначениеЗаполнено(АдресДоставкиИзЗаявки) Тогда
								АдресК =  АдресДоставкиИзЗаявки;
							ИначеЕсли НЕ ЗначениеЗаполнено(АдресДоставкиИзЗаявки) И ЗначениеЗаполнено(СтруктураДокумента.Регистратор.АдресДоставки) Тогда
								АдресК = СтруктураДокумента.Регистратор.АдресДоставки;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					МассивАдресов.Добавить(АдресК);
					СписокДокументов.Добавить(СтруктураДокумента);
				КонецЕсли;
				Если ОбходПоДокументам.ДатаКонтр <> NULL Тогда
					СтруктураДокумента = НовыйСтруктураДокумента(Истина);
					ЗаполнитьЗначенияСвойств(СтруктураДокумента, ОбходПоДокументам);
					СписокДокументовК.Добавить(СтруктураДокумента);
				КонецЕсли;
			КонецЦикла;
			
			// Не отображаем информацию по контрагенту, если не введены документы и сверка не согласована.
			// В этом случае будут пустые строки и итоги со стороны контрагента.
			ЗаполнятьДанныеКонтрагента = (ДанныеПечати.СверкаСогласована ИЛИ (СписокДокументовК.Количество() <> 0));
			
			// Выравняем таблицы по количеству строк
			РазницаСтрок = СписокДокументов.Количество() - СписокДокументовК.Количество();
			Если РазницаСтрок > 0 Тогда
				ДополняемаяТаблица = СписокДокументовК;
				НоваяСтрока = НовыйСтруктураДокумента(Истина);
			ИначеЕсли РазницаСтрок < 0 Тогда
				РазницаСтрок = -РазницаСтрок;
				ДополняемаяТаблица = СписокДокументов;
				НоваяСтрока = НовыйСтруктураДокумента();
			КонецЕсли;
			
			Для Счетчик = 1 По РазницаСтрок Цикл
				ДополняемаяТаблица.Добавить(НоваяСтрока);
				Если РазницаСтрок < 0 Тогда
					МассивАдресов.Добавить();
				КонецЕсли;	
			КонецЦикла;
			
			ЕстьСтрокиДокументов = (СписокДокументов.Количество() <> 0);
						
			Для Счетчик = 0 По СписокДокументов.Количество() - 1 Цикл
				// Выводим обороты
				ОбластьОбороты.Параметры.Заполнить(СписокДокументов[Счетчик]);
				ОбластьОбороты.Параметры.Заполнить(СписокДокументовК[Счетчик]);
				Если ЗначениеЗаполнено(ОбластьОбороты.Параметры.ПредставлениеКонтр) Тогда
					Предст = ОбластьОбороты.Параметры.ПредставлениеКонтр + Символы.ВК;
				Иначе
					Предст = "";
				КонецЕсли;	
				ОбластьОбороты.Параметры.ПредставлениеКонтр = Предст + МассивАдресов[Счетчик];
				//
				ТабличныйДокумент.Вывести(ОбластьОбороты);
			КонецЦикла;
			
		КонецЦикла;
		
		// Итоги по документам
		ОбластьОборотыИтог.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьОборотыИтог);
		
		// Итоги по контрагенту
		ОстатокНаКонец = ДанныеПечати.ОстатокНаНачало + ДанныеПечати.СуммаОборотДт - ДанныеПечати.СуммаОборотКт;
		Если ЗаполнятьДанныеКонтрагента Тогда
			ОстатокНаКонецКонтр = ДанныеПечати.ОстатокНаНачало - ДанныеПечати.СуммаОборотДтКонтр + ДанныеПечати.СуммаОборотКтКонтр;
		Иначе
			ОстатокНаКонецКонтр = 0;
		КонецЕсли;
		ПараметрыИтогиПоКонтрагенту = Новый Структура;
		ПараметрыИтогиПоКонтрагенту.Вставить("СуммаКонечныйОстатокДт",      ?(ОстатокНаКонец > 0, ОстатокНаКонец, 0));
		ПараметрыИтогиПоКонтрагенту.Вставить("СуммаКонечныйОстатокКт",      ?(ОстатокНаКонец < 0, -ОстатокНаКонец, 0));
		ПараметрыИтогиПоКонтрагенту.Вставить("СуммаКонечныйОстатокКтКонтр", ?(ОстатокНаКонецКонтр > 0, ОстатокНаКонецКонтр, 0));
		ПараметрыИтогиПоКонтрагенту.Вставить("СуммаКонечныйОстатокДтКонтр", ?(ОстатокНаКонецКонтр < 0, -ОстатокНаКонецКонтр, 0));
		ОбластьКонОстатки.Параметры.Заполнить(ПараметрыИтогиПоКонтрагенту);
		ТабличныйДокумент.Вывести(ОбластьКонОстатки);
		
		// Результаты сверки
		ПараметрыПодвала = Новый Структура;
		ПараметрыПодвала.Вставить("НаименованиеКонтрагента", ДанныеПечати.ПредставлениеКонтрагента);
		ПараметрыПодвала.Вставить("НазваниеОрганизации",     ДанныеПечати.Организация);
		ПараметрыПодвала.Вставить("Должность",               ДанныеПечати.ПредставительОрганизации.Должность);
		ПараметрыПодвала.Вставить("ДолжностьК",              ДанныеПечати.ПредставительКонтрагента.Должность);
		ПараметрыПодвала.Вставить("ФИОПредставителя",        СтрШаблон("(%1)", ДанныеПечати.ПредставительОрганизации));
		ПараметрыПодвала.Вставить("ФИОПредставителяК",       СтрШаблон("(%1)", ДанныеПечати.ПредставительКонтрагента));
		ПараметрыПодвала.Вставить("РезультатыСверки",
			РезультатСверки(ДанныеПечати, ОстатокНаКонец, ДанныеПечати.Организация, ДанныеПечати.Контрагент));
		Если ЗаполнятьДанныеКонтрагента Тогда
			ПараметрыПодвала.Вставить("РезультатыСверкиК",
				РезультатСверки(ДанныеПечати, ОстатокНаКонецКонтр, ДанныеПечати.Организация, ДанныеПечати.Контрагент));
		КонецЕсли;
		
		// Итог сверки выводим если нашли расхождение и сверка согласована.
		Если ДанныеПечати.Расхождение <> 0 И ДанныеПечати.СверкаСогласована Тогда
			СуммаРасхождение = ?(ДанныеПечати.Расхождение > 0, ДанныеПечати.Расхождение, -ДанныеПечати.Расхождение);
			ИтогСверки = СтрШаблон(НСтр("ru='В результате сверки выявлено расхождение информации о состоянии расчетов в размере %1 %2 %3'"),
				Формат(СуммаРасхождение, "ЧЦ=21; ЧДЦ=2"),
				Строка(ДанныеПечати.ВалютаДокумента),
				РаботаСВалютой.СформироватьЧислоПрописью(СуммаРасхождение, ДанныеПечати.ВалютаДокумента));
			ПараметрыПодвала.Вставить("ИтогСверки", Символы.ПС + ИтогСверки + Символы.ПС + " ");
		КонецЕсли;
//		
		Если СПечатью Тогда
			
//			ОтветственныеЛицаОрганизации = ОтветственныеЛицаБППовтИсп.ОтветственныеЛица(Шапка.Организация, Шапка.ДатаАктаСверки);

			ДвоичныеДанныеПечать = ДанныеПечати.Организация.ФайлПечать.Файл.Получить();
			Если ЗначениеЗаполнено(ДвоичныеДанныеПечать) Тогда
				ОбластьПодвал.Рисунки.Печать.Картинка = Новый Картинка(ДвоичныеДанныеПечать);
			КонецЕсли;
			Если ЗначениеЗаполнено(ДанныеПечати.ПредставительОрганизации) Тогда
				// Определим чью подпись необходимо подставить в документ. 
				// Определяем по ответственным лицам и представителю организации.
				Если ДанныеПечати.Организация.Руководитель = ДанныеПечати.ПредставительОрганизации Тогда
					ДвоичныеДанныеПодписьРуководителя = ДанныеПечати.Организация.ФайлПодписьРуководителя.Файл.Получить();
					Если ЗначениеЗаполнено(ДвоичныеДанныеПодписьРуководителя) Тогда 
						ОбластьПодвал.Рисунки.Подпись.Картинка = Новый Картинка(ДвоичныеДанныеПодписьРуководителя);
					КонецЕсли;
				ИначеЕсли ДанныеПечати.Организация.ГлавныйБухгалтер = ДанныеПечати.ПредставительОрганизации Тогда
					ДвоичныеДанныеПодписьГлавногоБухгалтера = ДанныеПечати.Организация.ФайлПодписьГлавногоБухгалтера.Файл.Получить();
					Если ЗначениеЗаполнено(ДвоичныеДанныеПодписьГлавногоБухгалтера) Тогда 
						ОбластьПодвал.Рисунки.Подпись.Картинка = Новый Картинка(ДвоичныеДанныеПодписьГлавногоБухгалтера);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ОбластьПодвал.Параметры.Заполнить(ПараметрыПодвала);
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		ТабличныйДокумент.ТолькоПросмотр = Истина;
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.АктСверки);
	
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции

Функция ПолучитьАдресИзЗаявкиНаДоставку(ЗаказПокупателя)
	
	Если Не ПолучитьФункциональнуюОпцию("УчитыватьДоставкуТовара") Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЗаявкаНаДоставкуОснования.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаДоставку.Основания КАК ЗаявкаНаДоставкуОснования
	|ГДЕ
	|	ЗаявкаНаДоставкуОснования.Основание = &Основание
	|	И НЕ ЗаявкаНаДоставкуОснования.Ссылка.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаявкаНаДоставкуОснования.Ссылка.Дата"; 
	
	Запрос.УстановитьПараметр("Основание", ЗаказПокупателя);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка.АдресДоставки;
	Иначе
		Возврат "";
	КонецЕсли;  
	
КонецФункции		
//nva--- 

Функция НовыйСтруктураДокумента(ПоДаннымКонтрагента = Ложь)

	СтруктураДокумента = Новый Структура;
	Если ПоДаннымКонтрагента Тогда
		Суффикс = "Контр";
	Иначе
		Суффикс = "";
	КонецЕсли;
	СтруктураДокумента.Вставить("Дата" + Суффикс);
	СтруктураДокумента.Вставить("Представление" + Суффикс);
	СтруктураДокумента.Вставить("Регистратор"   + Суффикс);
	СтруктураДокумента.Вставить("СуммаОборотДт" + Суффикс);
	СтруктураДокумента.Вставить("СуммаОборотКт" + Суффикс);
	
	Возврат СтруктураДокумента;
	
КонецФункции

Функция РезультатСверки(Шапка, ОстатокНаКонец, Организация, Контрагент)
	
	ШаблонРезультатСверки = НСтр("ru='на [ДатаСверки] задолженность [Заключение].'");
	ПараметрыИтогСверки = Новый Структура;
	ПараметрыИтогСверки.Вставить("ДатаСверки", Формат(Шапка.ДатаОкончания, "ДЛФ=D"));
	ПараметрыИтогСверки.Вставить("Заключение", НСтр("ru='отсутствует'"));
	
	Если ОстатокНаКонец <> 0 Тогда
		ШаблонЗаключение = НСтр("ru='в пользу [Представитель] [СуммаЦифрами] [Валюта] ([СуммаПрописью])'");
		ПараметрыЗаключение = Новый Структура("Представитель, СуммаЦифрами, Валюта, СуммаПрописью");
		ПараметрыЗаключение.Валюта = Шапка.ВалютаДокумента;
		Если ОстатокНаКонец > 0 Тогда
			ПараметрыЗаключение.Представитель = Организация;
			Множитель = 1;
		Иначе
			ПараметрыЗаключение.Представитель = Контрагент;
			Множитель = -1;
		КонецЕсли;
		
		ПараметрыЗаключение.СуммаЦифрами = Формат(Множитель * ОстатокНаКонец, "ЧЦ=21; ЧДЦ=2");
		ПараметрыЗаключение.СуммаПрописью = РаботаСВалютой.СформироватьЧислоПрописью(Множитель * ОстатокНаКонец, Шапка.ВалютаДокумента);
		
		ПараметрыИтогСверки.Заключение = 
			СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонЗаключение, ПараметрыЗаключение);
	КонецЕсли;
	
	Возврат СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонРезультатСверки, ПараметрыИтогСверки);
	
КонецФункции

#КонецОбласти

#КонецЕсли
